#include <math.h>
#include <cstdlib>
#include <iostream>
#include <sstream>
using namespace std;

// Забороняється змінювати сигнатуру функції Task1!  

// Функція знаходження найбільшого спільного дільника чисел a і b
unsigned int GCD(unsigned int a, unsigned int b) {	
    // Розмістіть тут Ваш код
}

// Функція знаходження оберненого до x за модулем m числа 
unsigned int Inverse(unsigned int x, unsigned int m) {
    // Розмістіть тут Ваш код
}

// Функція піднесення числа a до степеня n за модулем m
unsigned int QuickPower(unsigned int a, unsigned int n, unsigned int m) {
    // Розмістіть тут Ваш код	   
}

// Завдання 1
// 
// Функція приймає у якості аргументів:
// source - масив джерела інформації (масив десяткових чисел), 
// sourceSize - кількість елементів масиву джерела інформації, 
// p, q - прості числа для генерування пари ключів алгоритму RSA, 
// encryptionMode - передається true у випадку, коли необхідно здійснити 
//                  шифрування елементів масиву джерела інформації за 
//                  алгоритмом RSA і false - коли необхідно здійснити 
//                  дешифрування.
// 
// Функція повинна повертати рядок, який містить вивід результату застосування 
// процедури шифрування (дешифрування) за алгоритмом RSA до масиву джерела 
// інформації (послідовність розділених пробілами десяткових чисел). 
// Наприклад (масив M2 був визначений попередньо):
// Task1(M2,  4, 23, 31, true) - "491 190 549 269" (без лапок)
string Task1 (unsigned int* source, unsigned int sourceSize, unsigned int p, unsigned int q, bool encryptionMode) {
    // Об'єктом stringstream можна користуватись як і об'єктом iostream
    // Наприклад, коректним є запис
    // functionOutput << arr[i] << " ";
    stringstream functionOutput;

    // Перебір варіантів для відкритого ключа починати з 10 для підвищення 
    // рівня захищеності шифру
    
    // Розмістіть тут Ваш код

    // Конвертування об'єкту stringstream у рядок для відповідності сигнатурі функції
    return functionOutput.str();
}
